package main
import ("fmt"
			  )
func main() {
var D float64
fmt.Println("Введя число дней вы получите его соотношения с другими величинами")
fmt.Scan(&D)
fmt.Println("Вот соотношение с секундами", D,"*",86400,"=",D*86400)
fmt.Println("Вот соотношение с минутами", D,"*",1440,"=",D*1440)
fmt.Println("Вот соотношение с часами", D,"*",24,"=",D*24)
fmt.Println("Вот соотношение с днями", D,"/",1,"=",D)
fmt.Println("Вот соотношение с неделями", D,"/",7,"=",D/7)
fmt.Println("Вот соотношение с месяцами", D,"/",30,"=",D/30)
fmt.Println("Вот соотношение с годами", D,"/",365,"=",D/365)
}
/*
 * S - ~0.00001157
 * Min - ~0.0007
 * H - ~0.04
 * D - 1 (для ввода)
 * W - 7
 * M - ~30
 * Y - ~365
 */
